app/controllers/orders_controller.rb

INSERT INTO "orders" ("customer_id", "book_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 1], ["book_id", 1], ["status", "Confirmed"], ["created_at", "2016-06-07 14:02:13.899657"], ["updated_at", "2016-06-07 14:02:13.899657"]]
---
  def create
    @order = Order.create(order_params)

SELECT  "orders".* FROM "orders" WHERE (:id)  ORDER BY "orders"."id" ASC LIMIT 1
---
  def get
    @order = Order.where(params[:id]).first